import pytest

from src.masks import get_mask_card_number, get_mask_account

@pytest.mark.parametrize('card_numder, expected', [
    ("7000792289606361", "7000 79** **** 6361"),
    ("70007922896061","Неверный номер карты"),
    ("700079ffffffff","Неверный номер карты"),
    ('7000792289606361', '7000 79** **** 6361'),
    ('1596837868705199', '1596 83** **** 5199'),
    ('7158300734726758', '7158 30** **** 6758'),
    ('6831982476737658', '6831 98** **** 7658'),
    ('8990922113665229', '8990 92** **** 5229'),
    ('5999414228426353', '5999 41** **** 6353'),
    ('', 'Неверный номер карты'),
    ('12345667765433345566776543345677', 'Неверный номер карты'),
    (1234, 'Неверный тип данных'),
    (['lala', 'lalal', 'lalal'], 'Неверный тип данных'),
    ({'[f[f[', '[f[f[f'}, 'Неверный тип данных'),
    ('9999999999999999','9999 99** **** 9999'),
    ('0000000000000000','0000 00** **** 0000')
])
def test_get_mask_card_number(card_numder, expected):
    assert get_mask_card_number(card_numder) == expected


@pytest.mark.parametrize('value, expected', [
    ('73654108430135874305','**4305'),
    ('64686473678894779589','**9589'),
    ('35383033474447895560', '**5560'),
    ('73654108430135874305', '**4305'),
    ('7365410843013587lala', 'Неверный номер счета'),
    ('7365410843013587', 'Неверный номер счета'),
    ('', 'Неверный номер счета'),
    ('edyatlikoshimoshek', 'Неверный номер счета'),
    ('не ну а вдруг', 'Неверный номер счета'),
    ('', 'Неверный номер счета'),
    ('12345667765433345566776543345677', 'Неверный номер счета'),
    (1234,'Неверный тип данных'),
    (['lala','lalal','lalal'],'Неверный тип данных'),
    ({'[f[f[','[f[f[f'},'Неверный тип данных'),
    ('64686473678894779589', '**9589'),
    ('35383033474447895560', '**5560'),
    ('73654108430135874305', '**4305'),
])
def test_get_mask_account(value,expected):
    assert get_mask_account(value) == expected